DataProcessors/ис_СопоставлениеРаботПоСпецификации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ис_СопоставлениеРаботПоСпецификации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуСпецификации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПакета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПапкаРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гк_КлассификаторВидовРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расходники</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстыЗапросовКИИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокРаботИКатегорий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гк_КлассификаторВидовРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КатегорияНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРаботыНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РезультатыПодбора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеПозиции</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>449</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодИзделия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Завод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гк_КлассификаторВидовРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уверенность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтатьи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кодификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодВидаРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоловнаяНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРабот</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаИндикатив</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПомещения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРаботыНаименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьПрочихМатериалов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдИзмКВР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПересчета</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоСКоэффициентомПересчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолученоИзКеша</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Категории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Категория</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/гк_КлассификаторВидовРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>гк_КлассификаторВидовРабот</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Кодификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтатьяБДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ис_СопоставлениеРаботПоСпецификации/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ОбработатьВсеПозиции() Экспорт
	
	Если СписокРаботИКатегорий.Количество() = 0 Тогда
		ВызватьИсключение "Не загружен список работ и категорий!";
	КонецЕсли;
	
	Если РезультатыПодбора.Количество() = 0 Тогда
		ВызватьИсключение "Не загружена спецификация для обработки!";
	КонецЕсли;
	
	// Создаем таблицу уникальных позиций
	ТЗУникальныеПозиции = РезультатыПодбора.Выгрузить();
	ТЗУникальныеПозиции.Свернуть("НаименованиеПозиции, ТипМарка, ЕдиницаИзмерения, Завод, КодИзделия");
	
	// Обрабатываем уникальные позиции порциями по 50
	КоличествоУникальных = ТЗУникальныеПозиции.Количество();
	
	РазмерПорции = РазмерПакета;
	
	НачальныйИндекс = 0;
	
	НомерПорции = 1;
	
	Пока НачальныйИндекс < КоличествоУникальных Цикл
		
		КонечныйИндекс = Мин(НачальныйИндекс + РазмерПорции - 1, КоличествоУникальных - 1);
		
		// Формируем запрос для ChatGPT для текущей порции уникальных данных
		ТекстЗапроса = СформироватьЗапросДляУникальныхПозиций(ТЗУникальныеПозиции, НачальныйИндекс, КонечныйИндекс);
		
		ТекстыЗапросовКИИ = СтрШаблон("%1
		|Номер порции: %2. Текст запроса к ИИ для порции %2:
		|""%3""
		|
		|/////////////////////////////////
		|", ТекстыЗапросовКИИ, НомерПорции, ТекстЗапроса);
		
		// Отправляем запрос к API
		Результат = ОтправитьЗапросChatGPT(ТекстЗапроса);
		
		
		Если Результат <> Неопределено Тогда 
			РезультатПорции = гк_КоннекторHTTP.ОбъектВJson(Результат);
			
			ТекстыЗапросовКИИ = ТекстыЗапросовКИИ + Символы.ПС + "Ответ ИИ: " + РезультатПорции;
			
			ЗаполнитьРезультатыПодбораПорцией(Результат, ТЗУникальныеПозиции, НачальныйИндекс, КонечныйИндекс); 
			
		КонецЕсли;
		
		НачальныйИндекс = КонечныйИндекс + 1;
		
		НомерПорции = НомерПорции + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВыполнитьВФоне() Экспорт

	ис_ЗаполнениеСпецификаций.ОбработатьВсеПозиции(СписокРаботИКатегорий, РезультатыПодбора, 
		ПапкаРабот, ШаблонЗапроса, МодельЗапроса, РазмерПакета);

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьЗапросДляУникальныхПозиций(ТЗУникальныеПозиции, НачальныйИндекс, КонечныйИндекс)
	
	ТаблицаКатегорий = СписокРаботИКатегорий.Выгрузить( , "Категория");
	ТаблицаКатегорий.Свернуть("Категория"); 
	
	СписокДляАнализа = "";
	
	Для Каждого СтрокаТЧ Из ТаблицаКатегорий Цикл
		
		//СписокДляАнализа = СписокДляАнализа + Символы.ПС + "Категория: " + СтрокаТЧ.Категория.Наименование;
		МассивСтрокРабот = СписокРаботИКатегорий.НайтиСтроки(Новый Структура("Категория", СтрокаТЧ.Категория));
		
		Для каждого СтрокаРаботы Из МассивСтрокРабот Цикл
			СписокДляАнализа = СписокДляАнализа + Символы.ПС + СтрокаРаботы.ВидРаботы.Наименование;
		КонецЦикла;
		
	КонецЦикла; 
	
	МассивДанныхДляАнализа = Новый Массив;
	
	// Обрабатываем только порцию уникальных данных
	Для i = НачальныйИндекс По КонечныйИндекс Цикл
		СтрокаУникальнойПозиции = ТЗУникальныеПозиции[i];
		
		ДанныеДляАнализа = НовыеДанныеДляАнализа(); 
		
		ДанныеДляАнализа.НаименованиеПозиции = СтрокаУникальнойПозиции.НаименованиеПозиции;
		ДанныеДляАнализа.ТипМарка = СтрокаУникальнойПозиции.ТипМарка;
		ДанныеДляАнализа.ЕдиницаИзмерения = СтрокаУникальнойПозиции.ЕдиницаИзмерения; 
		ДанныеДляАнализа.Завод = СтрокаУникальнойПозиции.Завод; 
		ДанныеДляАнализа.КодИзделия = СтрокаУникальнойПозиции.КодИзделия; 
		
		МассивДанныхДляАнализа.Добавить(ДанныеДляАнализа);
	КонецЦикла;
	
	ДанныеДляАнализаJSON = гк_HTTPКонекторУниверсальный.ЗначениеВСтрокуJSON(МассивДанныхДляАнализа, Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Windows));
	
	ПравилаСопоставления = ис_НастройкиИнструментов.ПравилаПапки(ПапкаРабот);
	
	ТекстЗапроса = ШаблонЗапроса;

	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ДанныеДляАнализаJSON, СписокРаботИКатегорий[0].КатегорияНаименование, СписокДляАнализа, ПравилаСопоставления); 
	
	Возврат ТекстЗапроса;

КонецФункции

Процедура ЗаполнитьРезультатыПодбораПорцией(Результат, ТЗУникальныеПозиции, НачальныйИндекс, КонечныйИндекс)
	
	Если Не Результат.Свойство("results") Или Результат.results.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Обрабатываем результаты для каждой уникальной позиции
	Для i = 0 По Результат.results.Количество() - 1 Цикл
		ИндексВУникальных = НачальныйИндекс + i;
		
		Если ИндексВУникальных >= ТЗУникальныеПозиции.Количество() Тогда
			Прервать;
		КонецЕсли;
		
		СтрокаУникальнойПозиции = ТЗУникальныеПозиции[ИндексВУникальных];
		РезультатДляПозиции = Результат.results[i];
		
		// Находим все строки в оригинальной таблице, соответствующие этой уникальной позиции
		МассивСоответствующихСтрок = РезультатыПодбора.НайтиСтроки(Новый Структура(
			"НаименованиеПозиции", СокрЛП(СтрокаУникальнойПозиции.НаименованиеПозиции),
			//"ТипМарка", СтрокаУникальнойПозиции.ТипМарка,
			"ЕдиницаИзмерения", СтрокаУникальнойПозиции.ЕдиницаИзмерения
		));
		
		// Применяем результат ко всем соответствующим строкам
		Для Каждого СтрокаПозиции Из МассивСоответствующихСтрок Цикл
			Попытка
				
				Если ОбработатьИсключния(СтрокаПозиции, РезультатДляПозиции) Тогда
					Продолжить;
				КонецЕсли;
				
				//Если РезультатДляПозиции.Свойство("category") Тогда
				//	СтрокаПозиции.Категория = НайтиЭлементПоНаименованию(РезультатДляПозиции.category, "КатегорияНаименование"); 
				//КонецЕсли;
				
				Если РезультатДляПозиции.Свойство("work") Тогда
					СтрокаПозиции.ВидРаботы = НайтиЭлементПоНаименованию(РезультатДляПозиции.work, "ВидРаботыНаименование");
					СтрокаПозиции.ВидРаботыНаименование = СтрокаПозиции.ВидРаботы.Наименование;
					
					Если ЗначениеЗаполнено(СтрокаПозиции.ВидРаботы) Тогда 
						СтрокаПозиции.Категория = СтрокаПозиции.ВидРаботы.СтатьяБДДС;
						
						СтрокаПозиции.Кодификатор = СтрокаПозиции.ВидРаботы.Кодификатор;
						
						СтрокаПозиции.СтоимостьПрочихМатериалов = СтрокаПозиции.ВидРаботы.СтоимостьПрочиеМатериалы;
						КоличествоМатериалов = СтрокаПозиции.ВидРаботы.Материалы.Количество();
						
						Если  КоличествоМатериалов > 0 Тогда
							СтрокаПозиции.ГоловнаяНоменклатура = СтрокаПозиции.ВидРаботы.Материалы[0].Номенклатура;                      
							
							//СтрокаПозиции.ЦенаИндикатив = ПолучитьЗначениеЦеныПродажи(СтрокаПозиции.ВидРаботы.Материалы[0].Номенклатура);
							СтрокаПозиции.ЦенаИндикатив = ПолучитьЗначениеЦеныПродажи(СтрокаПозиции.ВидРаботы.Материалы[0].Номенклатура);
							Если КоличествоМатериалов > 1 Тогда
								СтрокаПозиции.Примечание = "Обнаружено более 1 позиции головной номенклатуры!"							
							КонецЕсли;								
						КонецЕсли;
						
						СтрокаПозиции.КодСтатьи = СтрокаПозиции.ВидРаботы.СтатьяБДДС.Кодификатор;
						//СтрокаПозиции.ЕдиницаИзмерения = СтрокаПозиции.ВидРаботы.ЕдиницаИзмерения;
						
						СтрокаПозиции.ЦенаРабот = СтрокаПозиции.ВидРаботы.СтоимостьРаботы;
					КонецЕсли;
				КонецЕсли;
				
				Если РезультатДляПозиции.Свойство("confidence") Тогда
					СтрокаПозиции.Уверенность = РезультатДляПозиции.confidence;
				КонецЕсли; 
			Исключение
				// Если не удалось обработать - оставляем пустым
				СтрокаПозиции.Категория = "";
				СтрокаПозиции.ВидРаботы = "";
				СтрокаПозиции.Уверенность = 0;
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ОбработатьИсключния(СтрокаПозиции, РезультатДляПозиции)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	гк_КлассификаторВидовРабот.СтатьяБДДС КАК Категория,
	|	гк_КлассификаторВидовРабот.СтатьяБДДС.Наименование КАК КатегорияНаименование
	|ИЗ
	|	Справочник.гк_КлассификаторВидовРабот КАК гк_КлассификаторВидовРабот
	|ГДЕ
	|	НЕ гк_КлассификаторВидовРабот.ПометкаУдаления
	|	И гк_КлассификаторВидовРабот.Ссылка В ИЕРАРХИИ(&Группа)
	|	И НЕ гк_КлассификаторВидовРабот.ЭтоГруппа
	|	И гк_КлассификаторВидовРабот.Кодификатор ПОДОБНО ""%.000""";
	
	Запрос.УстановитьПараметр("Группа", ПапкаРабот);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КатегорияДляИсключения = Выборка.Категория;
	Иначе
		КатегорияДляИсключения = Неопределено;	
	КонецЕсли;
	//
	//ЕстьИсключения = Ложь;
	//
	//МассивИсключений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Расходники, ",");
	
	ЭтоРасходник = Ложь;
	
	Если РезультатДляПозиции.Свойство("work") Тогда
		Если РезультатДляПозиции.work  = "Расходники" Тогда
			ЭтоРасходник = Истина;
		КонецЕсли;	
	КонецЕсли;
	Если РезультатДляПозиции.Свойство("category") Тогда
		Если РезультатДляПозиции.category = "Расходники" Тогда
			ЭтоРасходник = Истина;
		КонецЕсли;		
	КонецЕсли;                                 
	
	Если ЭтоРасходник Тогда
		СтрокаПозиции.ВидРаботыНаименование = "Расходники";
		СтрокаПозиции.Категория = КатегорияДляИсключения;
		СтрокаПозиции.КодСтатьи = СтрокаПозиции.Категория.Кодификатор;
		СтрокаПозиции.Уверенность = 0;
	КонецЕсли;
	
	Возврат ЭтоРасходник; 

КонецФункции

Функция ПолучитьЗначениеЦеныПродажи(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Материал", Номенклатура);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.гк_ВидыШаблонаССОМ.Основной);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	гк_ШаблонССОММатериалы.Ссылка КАК Ссылка,
	|	гк_ШаблонССОММатериалы.Материал.гк_ГоловнаяНоменклатура КАК гк_ГоловнаяНоменклатура,
	|	гк_ШаблонССОММатериалы.Цена КАК Цена
	|ИЗ
	|	Документ.гк_ШаблонССОМ.Материалы КАК гк_ШаблонССОММатериалы
	|ГДЕ
	|	гк_ШаблонССОММатериалы.Ссылка.ВидОперации = &ВидОперации
	|	И гк_ШаблонССОММатериалы.Материал.гк_ГоловнаяНоменклатура = &Материал";
		
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	
	Если ВыборкаДанных.Следующий() Тогда
		ЦенаПродажи = ВыборкаДанных.Цена;				
	Иначе 
		ЦенаПродажи = 0;
	КонецЕсли;
	
	Возврат ЦенаПродажи;
	
КонецФункции

Функция ОтправитьЗапросChatGPT(ТекстЗапроса)
		
	ОписаниеЗапроса = ai_Запросы.НовоеОписаниеЗапроса();
	
	ОписаниеЗапроса.ТекстЗапроса = ТекстЗапроса;
	ОписаниеЗапроса.КонтекстЗапроса = КонтекстЗапроса();	
	ОписаниеЗапроса.ПараметрыКонфигурацииЗапроса.ФорматОтвета = "json_object";
	ОписаниеЗапроса.ПараметрыКонфигурацииЗапроса.Модель = МодельЗапроса;
	
	//ТекстОтвета = ai_Запросы.ВыполнитьЗапрос(ОписаниеЗапроса, Токен); 
	ТекстОтвета = ai_Запросы.ВыполнитьЗапрос(ОписаниеЗапроса); 
	
	ДанныеОтвет = гк_HTTPКонекторУниверсальный.ЗначениеИзСтрокиJSON(ТекстОтвета);  
	
	Возврат ДанныеОтвет;
	
КонецФункции

Функция НовыеДанныеДляАнализа() 
	
	ДанныеДляАнализа = Новый Структура;
	
	ДанныеДляАнализа.Вставить("НаименованиеПозиции", "");
	ДанныеДляАнализа.Вставить("ТипМарка", "");
	ДанныеДляАнализа.Вставить("ЕдиницаИзмерения", "");
	ДанныеДляАнализа.Вставить("Завод", "");
	ДанныеДляАнализа.Вставить("КодИзделия", "");
	//ДанныеДляАнализа.Вставить("СписокДляАнализа", ""); 
	//ДанныеДляАнализа.Вставить("Правила", "");
	
	Возврат ДанныеДляАнализа;
	
КонецФункции

Функция НайтиЭлементПоНаименованию(ЗначениеПоиска, ИмяКолонки)

	НайденнаяСтрока = СписокРаботИКатегорий.Найти(ЗначениеПоиска, ИмяКолонки);	
	
	Если НЕ НайденнаяСтрока = Неопределено Тогда
		Возврат НайденнаяСтрока[СтрЗаменить(ИмяКолонки, "Наименование", "")];
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция КонтекстЗапроса()
		
	КонтекстЗапроса = "Ты эксперт по инженерным системам. Анализируй запрос и дай экспертный ответ.";
	
	Возврат КонтекстЗапроса;
	
КонецФункции 

#КонецОбласти
